In [40]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
pd.options.display.float_format = '{:.3f}'.format

In [41]:
avocado = pd.read_csv("dataset/avocado_2015_to_2020.csv")

In [42]:
avocado.head()

,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,Type,Year,Region,Month
0,1.750,27365.890,9307.340,3844.810,615.280,13598.460,13061.100,537.360,0.000,Organic,2015,Southeast,Jan
1,1.490,17723.170,1189.350,15628.270,0.000,905.550,905.550,0.000,0.000,Organic,2015,Chicago,Jan
2,1.680,2896.720,161.680,206.960,0.000,2528.080,2528.080,0.000,0.000,Organic,2015,HarrisburgScranton,Jan
3,1.520,54956.800,3013.040,35456.880,1561.700,14925.180,11264.800,3660.380,0.000,Conventional,2015,Pittsburgh,Jan
4,1.640,1505.120,1.270,1129.500,0.000,374.350,186.670,187.680,0.000,Organic,2015,Boise,Jan

In [43]:
avocado = avocado.rename(columns={"4046": "Small/Medium Hass", "4225": "Large Hass", "4770": "Extra Large Hass"})

In [44]:
avocado.head()

,AveragePrice,Total Volume,Small/Medium Hass,Large Hass,Extra Large Hass,Total Bags,Small Bags,Large Bags,XLarge Bags,Type,Year,Region,Month
0,1.750,27365.890,9307.340,3844.810,615.280,13598.460,13061.100,537.360,0.000,Organic,2015,Southeast,Jan
1,1.490,17723.170,1189.350,15628.270,0.000,905.550,905.550,0.000,0.000,Organic,2015,Chicago,Jan
2,1.680,2896.720,161.680,206.960,0.000,2528.080,2528.080,0.000,0.000,Organic,2015,HarrisburgScranton,Jan
3,1.520,54956.800,3013.040,35456.880,1561.700,14925.180,11264.800,3660.380,0.000,Conventional,2015,Pittsburgh,Jan
4,1.640,1505.120,1.270,1129.500,0.000,374.350,186.670,187.680,0.000,Organic,2015,Boise,Jan

In [45]:
month_order = avocado["Month"].unique()
year_order = avocado["Year"].unique()

In [46]:
average_total_per_year_month_region = avocado.groupby(["Year", "Month", "Region"])\
                        .agg({"AveragePrice": "mean", "Total Volume": "sum"})\
                        .reindex(month_order, level=1)

In [47]:
average_total_per_year_month_region["Total Value (Million $)"] = average_total_per_year_month_region["AveragePrice"] *\
                                                                 average_total_per_year_month_region["Total Volume"] /\
                                                                 1000000

In [48]:
average_total_per_year_month_region

                                AveragePrice  Total Volume  \
Year Month Region
2015 Jan   Albany                      1.509    176518.010
           Atlanta                     1.456   1728319.950
           BaltimoreWashington         1.251   2883524.150
           Boise                       1.330    274361.810
           Boston                      1.538   1748752.350
...                                      ...           ...
2020 Apr   Syracuse                    1.430    332100.350
           Tampa                       1.188   1993182.690
           TotalUS                     1.380 154914148.930
           West                        1.427  25890302.060
           WestTexNewMexico            1.292   3545293.320

                                Total Value (Million $)
Year Month Region
2015 Jan   Albany                                 0.266
           Atlanta                                2.517
           BaltimoreWashington                    3.608
           Boise                                  0.365
           Boston                                 2.689
...                                                 ...
2020 Apr   Syracuse                               0.475
           Tampa                                  2.369
           TotalUS                              213.782
           West                                  36.937
           WestTexNewMexico                       4.579

[3456 rows x 3 columns]